[Killed] BlockStatement
riskCalculator.js:1:58
-function calculateRisk({ age, bmi, bp, sugar, smoking }) {
-  let risk = 0;
-
-  if (age > 40) risk += 20;
-  if (bmi > 25) risk += 20;
-  if (bp === "high") risk += 20;
-  if (sugar === "high") risk += 25;
-  if (smoking === "yes") risk += 15;
-
-  let level = "LOW";
-  if (risk > 60) level = "HIGH";
-  else if (risk > 30) level = "MEDIUM";
-
-  return {
-    risk,
-    level,
-    advice:
-      level === "HIGH"
-        ? "Consult a doctor immediately"
-        : level === "MEDIUM"
-        ? "Maintain a healthy lifestyle"
-        : "You are in good condition",
-  };
-}
+function calculateRisk({ age, bmi, bp, sugar, smoking }) {}
 
 module.exports = calculateRisk;
killedBy: High Risk Case
statusReason: TypeError: Cannot read properties of undefined (reading 'risk')

[Killed] EqualityOperator
riskCalculator.js:4:7
 function calculateRisk({ age, bmi, bp, sugar, smoking }) {
   let risk = 0;
 
-  if (age > 40) risk += 20;
+  if (age <= 40) risk += 20;
   if (bmi > 25) risk += 20;
   if (bp === "high") risk += 20;
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 80

[Killed] EqualityOperator
riskCalculator.js:5:7
   let risk = 0;
 
   if (age > 40) risk += 20;
-  if (bmi > 25) risk += 20;
+  if (bmi <= 25) risk += 20;
   if (bp === "high") risk += 20;
   if (sugar === "high") risk += 25;
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 80

[Killed] ConditionalExpression
riskCalculator.js:6:7
 
   if (age > 40) risk += 20;
   if (bmi > 25) risk += 20;
-  if (bp === "high") risk += 20;
+  if (false) risk += 20;
   if (sugar === "high") risk += 25;
   if (smoking === "yes") risk += 15;
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 80

[Killed] EqualityOperator
riskCalculator.js:6:7
 
   if (age > 40) risk += 20;
   if (bmi > 25) risk += 20;
-  if (bp === "high") risk += 20;
+  if (bp !== "high") risk += 20;
   if (sugar === "high") risk += 25;
   if (smoking === "yes") risk += 15;
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 80

[Killed] ConditionalExpression
riskCalculator.js:7:7
   if (age > 40) risk += 20;
   if (bmi > 25) risk += 20;
   if (bp === "high") risk += 20;
-  if (sugar === "high") risk += 25;
+  if (false) risk += 25;
   if (smoking === "yes") risk += 15;
 
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 75

[Killed] StringLiteral
riskCalculator.js:10:15
   if (sugar === "high") risk += 25;
   if (smoking === "yes") risk += 15;
 
-  let level = "LOW";
+  let level = "";
   if (risk > 60) level = "HIGH";
   else if (risk > 30) level = "MEDIUM";
killedBy: Low Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LOW"
Received: ""

[Killed] EqualityOperator
riskCalculator.js:11:7
   if (smoking === "yes") risk += 15;
 
   let level = "LOW";
-  if (risk > 60) level = "HIGH";
+  if (risk <= 60) level = "HIGH";
   else if (risk > 30) level = "MEDIUM";
 
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "HIGH"
Received: "MEDIUM"

[Killed] ObjectLiteral
riskCalculator.js:14:10
   if (risk > 60) level = "HIGH";
   else if (risk > 30) level = "MEDIUM";
 
-  return {
-    risk,
-    level,
-    advice:
-      level === "HIGH"
-        ? "Consult a doctor immediately"
-        : level === "MEDIUM"
-        ? "Maintain a healthy lifestyle"
-        : "You are in good condition",
-  };
+  return {};
 }
 
killedBy: High Risk Case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Survived] EqualityOperator
riskCalculator.js:18:7
     risk,
     level,
     advice:
-      level === "HIGH"
+      level !== "HIGH"
         ? "Consult a doctor immediately"
         : level === "MEDIUM"
