[Survived] ObjectLiteral
controllers/authController.js:11:45
     const { name, email, password, role, specialty } = req.body;
 
     // Check if user exists
-    const existingUser = await User.findOne({ email });
+    const existingUser = await User.findOne({});
     if (existingUser) {
       return res.status(400).json({ msg: "User already exists" });

[Survived] ConditionalExpression
controllers/authController.js:12:9
 
     // Check if user exists
     const existingUser = await User.findOne({ email });
-    if (existingUser) {
+    if (false) {
       return res.status(400).json({ msg: "User already exists" });
     }

[Survived] BlockStatement
controllers/authController.js:12:23
 
     // Check if user exists
     const existingUser = await User.findOne({ email });
-    if (existingUser) {
-      return res.status(400).json({ msg: "User already exists" });
-    }
+    if (existingUser) {}
 
     const hashed = await bcrypt.hash(password, 10);

[Survived] StringLiteral
controllers/authController.js:13:42
     // Check if user exists
     const existingUser = await User.findOne({ email });
     if (existingUser) {
-      return res.status(400).json({ msg: "User already exists" });
+      return res.status(400).json({ msg: "" });
     }
 

[Survived] ObjectLiteral
controllers/authController.js:19:39
     const hashed = await bcrypt.hash(password, 10);
 
     // Create user object
-    const newUser = await User.create({
-      name,
-      email,
-      password: hashed,
-      role: role === "admin" ? "patient" : (role || "patient"),
-      // Save specialty only if the role is doctor, otherwise undefined
-      specialty: role === "doctor" ? specialty : undefined
-    });
+    const newUser = await User.create({});
 
     console.log("User registered successfully"); 

[Survived] ConditionalExpression
controllers/authController.js:23:13
       name,
       email,
       password: hashed,
-      role: role === "admin" ? "patient" : (role || "patient"),
+      role: false ? "patient" : (role || "patient"),
       // Save specialty only if the role is doctor, otherwise undefined
       specialty: role === "doctor" ? specialty : undefined

[Survived] ConditionalExpression
controllers/authController.js:23:45
       name,
       email,
       password: hashed,
-      role: role === "admin" ? "patient" : (role || "patient"),
+      role: role === "admin" ? "patient" : (true),
       // Save specialty only if the role is doctor, otherwise undefined
       specialty: role === "doctor" ? specialty : undefined

[Survived] ConditionalExpression
controllers/authController.js:25:18
       password: hashed,
       role: role === "admin" ? "patient" : (role || "patient"),
       // Save specialty only if the role is doctor, otherwise undefined
-      specialty: role === "doctor" ? specialty : undefined
+      specialty: true ? specialty : undefined
     });
 

[Survived] EqualityOperator
controllers/authController.js:25:18
       password: hashed,
       role: role === "admin" ? "patient" : (role || "patient"),
       // Save specialty only if the role is doctor, otherwise undefined
-      specialty: role === "doctor" ? specialty : undefined
+      specialty: role !== "doctor" ? specialty : undefined
     });
 

[Survived] BlockStatement
controllers/authController.js:32:17
 
     res.json({ msg: "Registration successful", userId: newUser._id });
 
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ msg: "Server error during registration" });
-  }
+  } catch (err) {}
 };
 

[Survived] StringLiteral
controllers/authController.js:34:33
 
   } catch (err) {
     console.error(err);
-    res.status(500).json({ msg: "Server error during registration" });
+    res.status(500).json({ msg: "" });
   }
 };

[Survived] StringLiteral
controllers/authController.js:40:17
 
 exports.login = async (req, res) => {
   try {
-    console.log("LOGIN ATTEMPT:", req.body);
+    console.log("", req.body);
 
     const user = await User.findOne({ email: req.body.email });

[Survived] StringLiteral
controllers/authController.js:47:35
 
     if (!user) {
       console.log("User not found");
-      return res.status(400).send("User not found");
+      return res.status(400).send("");
     }
 

[Survived] StringLiteral
controllers/authController.js:50:17
       return res.status(400).send("User not found");
     }
 
-    console.log("Entered Password:", req.body.password);
+    console.log("", req.body.password);
     console.log("Stored Hash:", user.password);
 

[Survived] BooleanLiteral
controllers/authController.js:56:9
     const valid = await bcrypt.compare(req.body.password, user.password);
     console.log("Password Match Result:", valid);
 
-    if (!valid) {
+    if (valid) {
       console.log("Password mismatch");
       return res.status(400).send("Wrong password");

[Survived] BlockStatement
controllers/authController.js:56:17
     const valid = await bcrypt.compare(req.body.password, user.password);
     console.log("Password Match Result:", valid);
 
-    if (!valid) {
-      console.log("Password mismatch");
-      return res.status(400).send("Wrong password");
-    }
+    if (!valid) {}
 
     const token = jwt.sign(

[Survived] StringLiteral
controllers/authController.js:57:19
     console.log("Password Match Result:", valid);
 
     if (!valid) {
-      console.log("Password mismatch");
+      console.log("");
       return res.status(400).send("Wrong password");
     }

[Survived] StringLiteral
controllers/authController.js:67:17
       { expiresIn: "1d" }
     );
 
-    console.log("LOGIN SUCCESS");
+    console.log("");
 
     res.json({

[Survived] BlockStatement
controllers/authController.js:76:17
       specialty: user.specialty
     });
 
-  } catch (err) {
-    console.error("LOGIN ERROR:", err);
-    res.status(500).send("Login error");
-  }
+  } catch (err) {}
 };
 

[Survived] StringLiteral
controllers/authController.js:78:26
 
   } catch (err) {
     console.error("LOGIN ERROR:", err);
-    res.status(500).send("Login error");
+    res.status(500).send("");
   }
 };

[Survived] BlockStatement
controllers/authController.js:82:42
   }
 };
 
-exports.getProfile = async (req, res) => {
-  try {
-    const user = await User.findById(req.userId).select("-password");
-    res.json(user);
-  } catch (err) {
-    res.status(500).send("Error fetching profile");
-  }
-};
+exports.getProfile = async (req, res) => {};

[Survived] BlockStatement
controllers/authController.js:83:7
 };
 
 exports.getProfile = async (req, res) => {
-  try {
-    const user = await User.findById(req.userId).select("-password");
-    res.json(user);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).send("Error fetching profile");
   }

[Survived] StringLiteral
controllers/authController.js:84:57
 
 exports.getProfile = async (req, res) => {
   try {
-    const user = await User.findById(req.userId).select("-password");
+    const user = await User.findById(req.userId).select("");
     res.json(user);
   } catch (err) {

[Survived] BlockStatement
controllers/authController.js:86:17
   try {
     const user = await User.findById(req.userId).select("-password");
     res.json(user);
-  } catch (err) {
-    res.status(500).send("Error fetching profile");
-  }
+  } catch (err) {}
 };

[Survived] StringLiteral
controllers/authController.js:87:26
     const user = await User.findById(req.userId).select("-password");
     res.json(user);
   } catch (err) {
-    res.status(500).send("Error fetching profile");
+    res.status(500).send("");
   }
 };
