[Survived] BlockStatement
routes/recordRoutes.js:14:44
 const router = express.Router();
 
 /* ================= AUTH MIDDLEWARE ================= */
-const authMiddleware = (req, res, next) => {
-  const token = req.headers.authorization?.split(" ")[1];
-  if (!token) return res.status(401).json({ message: "No token" });
-
-  try {
-    const decoded = jwt.verify(token, "healthcareSecret");
-    req.user = decoded; 
-    next();
-  } catch (err) {
-    return res.status(401).json({ message: "Invalid token" });
-  }
-};
+const authMiddleware = (req, res, next) => {};
 
 /* ================= MULTER CONFIG ================= */

[Survived] OptionalChaining
routes/recordRoutes.js:15:17
 
 /* ================= AUTH MIDDLEWARE ================= */
 const authMiddleware = (req, res, next) => {
-  const token = req.headers.authorization?.split(" ")[1];
+  const token = req.headers.authorization.split(" ")[1];
   if (!token) return res.status(401).json({ message: "No token" });
 

[Survived] StringLiteral
routes/recordRoutes.js:15:50
 
 /* ================= AUTH MIDDLEWARE ================= */
 const authMiddleware = (req, res, next) => {
-  const token = req.headers.authorization?.split(" ")[1];
+  const token = req.headers.authorization?.split("")[1];
   if (!token) return res.status(401).json({ message: "No token" });
 

[Survived] ConditionalExpression
routes/recordRoutes.js:16:7
 /* ================= AUTH MIDDLEWARE ================= */
 const authMiddleware = (req, res, next) => {
   const token = req.headers.authorization?.split(" ")[1];
-  if (!token) return res.status(401).json({ message: "No token" });
+  if (true) return res.status(401).json({ message: "No token" });
 
   try {

[Survived] BooleanLiteral
routes/recordRoutes.js:16:7
 /* ================= AUTH MIDDLEWARE ================= */
 const authMiddleware = (req, res, next) => {
   const token = req.headers.authorization?.split(" ")[1];
-  if (!token) return res.status(401).json({ message: "No token" });
+  if (token) return res.status(401).json({ message: "No token" });
 
   try {

[Survived] BlockStatement
routes/recordRoutes.js:18:7
   const token = req.headers.authorization?.split(" ")[1];
   if (!token) return res.status(401).json({ message: "No token" });
 
-  try {
-    const decoded = jwt.verify(token, "healthcareSecret");
-    req.user = decoded; 
-    next();
-  } catch (err) {
+  try {} catch (err) {
     return res.status(401).json({ message: "Invalid token" });
   }

[Survived] BlockStatement
routes/recordRoutes.js:22:17
     const decoded = jwt.verify(token, "healthcareSecret");
     req.user = decoded; 
     next();
-  } catch (err) {
-    return res.status(401).json({ message: "Invalid token" });
-  }
+  } catch (err) {}
 };
 

[Survived] ObjectLiteral
routes/recordRoutes.js:23:33
     req.user = decoded; 
     next();
   } catch (err) {
-    return res.status(401).json({ message: "Invalid token" });
+    return res.status(401).json({});
   }
 };

[Survived] BlockStatement
routes/recordRoutes.js:29:41
 
 /* ================= MULTER CONFIG ================= */
 const storage = multer.diskStorage({
-  destination: function (req, file, cb) {
-    if (!fs.existsSync("uploads")) {
-      fs.mkdirSync("uploads");
-    }
-    cb(null, "uploads/");
-  },
+  destination: function (req, file, cb) {},
   filename: function (req, file, cb) {
     cb(null, Date.now() + "-" + file.originalname.replace(/\s+/g, "_"));

[Survived] ConditionalExpression
routes/recordRoutes.js:30:9
 /* ================= MULTER CONFIG ================= */
 const storage = multer.diskStorage({
   destination: function (req, file, cb) {
-    if (!fs.existsSync("uploads")) {
+    if (true) {
       fs.mkdirSync("uploads");
     }

[Survived] ConditionalExpression
routes/recordRoutes.js:30:9
 /* ================= MULTER CONFIG ================= */
 const storage = multer.diskStorage({
   destination: function (req, file, cb) {
-    if (!fs.existsSync("uploads")) {
+    if (false) {
       fs.mkdirSync("uploads");
     }

[Survived] StringLiteral
routes/recordRoutes.js:31:20
 const storage = multer.diskStorage({
   destination: function (req, file, cb) {
     if (!fs.existsSync("uploads")) {
-      fs.mkdirSync("uploads");
+      fs.mkdirSync("");
     }
     cb(null, "uploads/");

[Survived] StringLiteral
routes/recordRoutes.js:33:14
     if (!fs.existsSync("uploads")) {
       fs.mkdirSync("uploads");
     }
-    cb(null, "uploads/");
+    cb(null, "");
   },
   filename: function (req, file, cb) {

[Survived] BlockStatement
routes/recordRoutes.js:35:38
     }
     cb(null, "uploads/");
   },
-  filename: function (req, file, cb) {
-    cb(null, Date.now() + "-" + file.originalname.replace(/\s+/g, "_"));
-  }
+  filename: function (req, file, cb) {}
 });
 

[Survived] Regex
routes/recordRoutes.js:36:59
     cb(null, "uploads/");
   },
   filename: function (req, file, cb) {
-    cb(null, Date.now() + "-" + file.originalname.replace(/\s+/g, "_"));
+    cb(null, Date.now() + "-" + file.originalname.replace(/\s/g, "_"));
   }
 });

[Survived] ArithmeticOperator
routes/recordRoutes.js:42:23
 
 const upload = multer({
   storage,
-  limits: { fileSize: 10 * 1024 * 1024 }
+  limits: { fileSize: 10 * 1024 / 1024 }
 });
 

[Survived] ArithmeticOperator
routes/recordRoutes.js:42:23
 
 const upload = multer({
   storage,
-  limits: { fileSize: 10 * 1024 * 1024 }
+  limits: { fileSize: 10 / 1024 * 1024 }
 });
 

[Survived] BlockStatement
routes/recordRoutes.js:47:68
 
 /* ================= 1. GET ALL PATIENTS (For Doctor Dropdown) ================= */
 // UPDATED PATH: /doctor/patients (Matches frontend)
-router.get("/doctor/patients", authMiddleware, async (req, res) => {
-  try {
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Access denied" });
-    }
-    const patients = await User.find({ role: "patient" }).select("name email _id");
-    res.json(patients);
-  } catch (err) {
-    res.status(500).json({ message: "Failed to fetch patients" });
-  }
-});
+router.get("/doctor/patients", authMiddleware, async (req, res) => {});
 
 /* ================= 2. UPLOAD RECORD (Doctor Uploads for Patient) ================= */

[Survived] BlockStatement
routes/recordRoutes.js:48:7
 /* ================= 1. GET ALL PATIENTS (For Doctor Dropdown) ================= */
 // UPDATED PATH: /doctor/patients (Matches frontend)
 router.get("/doctor/patients", authMiddleware, async (req, res) => {
-  try {
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Access denied" });
-    }
-    const patients = await User.find({ role: "patient" }).select("name email _id");
-    res.json(patients);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Failed to fetch patients" });
   }

[Survived] EqualityOperator
routes/recordRoutes.js:49:9
 // UPDATED PATH: /doctor/patients (Matches frontend)
 router.get("/doctor/patients", authMiddleware, async (req, res) => {
   try {
-    if (req.user.role !== "doctor") {
+    if (req.user.role === "doctor") {
       return res.status(403).json({ message: "Access denied" });
     }

[Survived] ConditionalExpression
routes/recordRoutes.js:49:9
 // UPDATED PATH: /doctor/patients (Matches frontend)
 router.get("/doctor/patients", authMiddleware, async (req, res) => {
   try {
-    if (req.user.role !== "doctor") {
+    if (false) {
       return res.status(403).json({ message: "Access denied" });
     }

[Survived] StringLiteral
routes/recordRoutes.js:50:46
 router.get("/doctor/patients", authMiddleware, async (req, res) => {
   try {
     if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Access denied" });
+      return res.status(403).json({ message: "" });
     }
     const patients = await User.find({ role: "patient" }).select("name email _id");

[Survived] BlockStatement
routes/recordRoutes.js:54:17
     }
     const patients = await User.find({ role: "patient" }).select("name email _id");
     res.json(patients);
-  } catch (err) {
-    res.status(500).json({ message: "Failed to fetch patients" });
-  }
+  } catch (err) {}
 });
 

[Survived] StringLiteral
routes/recordRoutes.js:55:37
     const patients = await User.find({ role: "patient" }).select("name email _id");
     res.json(patients);
   } catch (err) {
-    res.status(500).json({ message: "Failed to fetch patients" });
+    res.status(500).json({ message: "" });
   }
 });

[Survived] ConditionalExpression
routes/recordRoutes.js:63:9
 // UPDATED PATH: /doctor/upload-record (Matches frontend)
 router.post("/doctor/upload-record", authMiddleware, upload.single("file"), async (req, res) => {
   try {
-    if (!req.file) return res.status(400).json({ message: "No file uploaded" });
+    if (true) return res.status(400).json({ message: "No file uploaded" });
     if (req.user.role !== "doctor") {
       return res.status(403).json({ message: "Only doctors can upload records" });

[Survived] BooleanLiteral
routes/recordRoutes.js:63:9
 // UPDATED PATH: /doctor/upload-record (Matches frontend)
 router.post("/doctor/upload-record", authMiddleware, upload.single("file"), async (req, res) => {
   try {
-    if (!req.file) return res.status(400).json({ message: "No file uploaded" });
+    if (req.file) return res.status(400).json({ message: "No file uploaded" });
     if (req.user.role !== "doctor") {
       return res.status(403).json({ message: "Only doctors can upload records" });

[Survived] ConditionalExpression
routes/recordRoutes.js:64:9
 router.post("/doctor/upload-record", authMiddleware, upload.single("file"), async (req, res) => {
   try {
     if (!req.file) return res.status(400).json({ message: "No file uploaded" });
-    if (req.user.role !== "doctor") {
+    if (true) {
       return res.status(403).json({ message: "Only doctors can upload records" });
     }

[Survived] BlockStatement
routes/recordRoutes.js:64:37
 router.post("/doctor/upload-record", authMiddleware, upload.single("file"), async (req, res) => {
   try {
     if (!req.file) return res.status(400).json({ message: "No file uploaded" });
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Only doctors can upload records" });
-    }
+    if (req.user.role !== "doctor") {}
 
     const { patientId, title } = req.body; 

[Survived] StringLiteral
routes/recordRoutes.js:65:46
   try {
     if (!req.file) return res.status(400).json({ message: "No file uploaded" });
     if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Only doctors can upload records" });
+      return res.status(403).json({ message: "" });
     }
 

[Survived] ConditionalExpression
routes/recordRoutes.js:70:9
 
     const { patientId, title } = req.body; 
 
-    if (!patientId || !title) {
+    if (false) {
       return res.status(400).json({ message: "Patient ID and Title are required" });
     }

[Survived] BooleanLiteral
routes/recordRoutes.js:70:9
 
     const { patientId, title } = req.body; 
 
-    if (!patientId || !title) {
+    if (patientId || !title) {
       return res.status(400).json({ message: "Patient ID and Title are required" });
     }

[Survived] BlockStatement
routes/recordRoutes.js:88:17
     await newRecord.save();
     res.json(newRecord);
 
-  } catch (err) {
-    console.error("Upload error:", err);
-    res.status(500).json({ message: "Upload failed" });
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
routes/recordRoutes.js:96:68
 
 /* ================= 3. GET MY RECORDS (Patient View) ================= */
 // UPDATED PATH: /patient/records (Matches frontend)
-router.get("/patient/records", authMiddleware, async (req, res) => {
-  try {
-    const records = await Record.find({ user: req.user.id })
-      .populate("uploadedBy", "name") 
-      .sort({ createdAt: -1 });
-
-    const formattedRecords = records.map(rec => ({
-      ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
-    }));
-
-    res.json(formattedRecords);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching records" });
-  }
-});
+router.get("/patient/records", authMiddleware, async (req, res) => {});
 
 /* ================= 4. GET SPECIFIC PATIENT RECORDS (Doctor View) ================= */

[Survived] BlockStatement
routes/recordRoutes.js:97:7
 /* ================= 3. GET MY RECORDS (Patient View) ================= */
 // UPDATED PATH: /patient/records (Matches frontend)
 router.get("/patient/records", authMiddleware, async (req, res) => {
-  try {
-    const records = await Record.find({ user: req.user.id })
-      .populate("uploadedBy", "name") 
-      .sort({ createdAt: -1 });
-
-    const formattedRecords = records.map(rec => ({
-      ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
-    }));
-
-    res.json(formattedRecords);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Error fetching records" });
   }

[Survived] MethodExpression
routes/recordRoutes.js:98:27
 // UPDATED PATH: /patient/records (Matches frontend)
 router.get("/patient/records", authMiddleware, async (req, res) => {
   try {
-    const records = await Record.find({ user: req.user.id })
-      .populate("uploadedBy", "name") 
-      .sort({ createdAt: -1 });
+    const records = await Record.find({
+  user: req.user.id
+}).populate("uploadedBy", "name");
 
     const formattedRecords = records.map(rec => ({

[Survived] UnaryOperator
routes/recordRoutes.js:100:26
   try {
     const records = await Record.find({ user: req.user.id })
       .populate("uploadedBy", "name") 
-      .sort({ createdAt: -1 });
+      .sort({ createdAt: +1 });
 
     const formattedRecords = records.map(rec => ({

[Survived] ObjectLiteral
routes/recordRoutes.js:100:13
   try {
     const records = await Record.find({ user: req.user.id })
       .populate("uploadedBy", "name") 
-      .sort({ createdAt: -1 });
+      .sort({});
 
     const formattedRecords = records.map(rec => ({

[Survived] ArrowFunction
routes/recordRoutes.js:102:42
       .populate("uploadedBy", "name") 
       .sort({ createdAt: -1 });
 
-    const formattedRecords = records.map(rec => ({
-      ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
-    }));
+    const formattedRecords = records.map(() => undefined);
 
     res.json(formattedRecords);

[Survived] BlockStatement
routes/recordRoutes.js:108:17
     }));
 
     res.json(formattedRecords);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching records" });
-  }
+  } catch (err) {}
 });
 

[Survived] ObjectLiteral
routes/recordRoutes.js:109:26
 
     res.json(formattedRecords);
   } catch (err) {
-    res.status(500).json({ message: "Error fetching records" });
+    res.status(500).json({});
   }
 });

[Survived] BlockStatement
routes/recordRoutes.js:114:79
 });
 
 /* ================= 4. GET SPECIFIC PATIENT RECORDS (Doctor View) ================= */
-router.get("/records/patient/:patientId", authMiddleware, async (req, res) => {
-  try {
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Access denied" });
-    }
-
-    const records = await Record.find({ user: req.params.patientId }).sort({ createdAt: -1 });
-    
-    const formattedRecords = records.map(rec => ({
-      ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
-    }));
-
-    res.json(formattedRecords);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching patient records" });
-  }
-});
+router.get("/records/patient/:patientId", authMiddleware, async (req, res) => {});
 
 /* ================= 5. DELETE RECORD (Doctor Only) ================= */

[Survived] BlockStatement
routes/recordRoutes.js:115:7
 
 /* ================= 4. GET SPECIFIC PATIENT RECORDS (Doctor View) ================= */
 router.get("/records/patient/:patientId", authMiddleware, async (req, res) => {
-  try {
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Access denied" });
-    }
-
-    const records = await Record.find({ user: req.params.patientId }).sort({ createdAt: -1 });
-    
-    const formattedRecords = records.map(rec => ({
-      ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
-    }));
-
-    res.json(formattedRecords);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Error fetching patient records" });
   }

[Survived] ConditionalExpression
routes/recordRoutes.js:116:9
 /* ================= 4. GET SPECIFIC PATIENT RECORDS (Doctor View) ================= */
 router.get("/records/patient/:patientId", authMiddleware, async (req, res) => {
   try {
-    if (req.user.role !== "doctor") {
+    if (true) {
       return res.status(403).json({ message: "Access denied" });
     }

[Survived] MethodExpression
routes/recordRoutes.js:120:27
       return res.status(403).json({ message: "Access denied" });
     }
 
-    const records = await Record.find({ user: req.params.patientId }).sort({ createdAt: -1 });
+    const records = await Record.find({
+  user: req.params.patientId
+});
     
     const formattedRecords = records.map(rec => ({

[Survived] UnaryOperator
routes/recordRoutes.js:120:89
       return res.status(403).json({ message: "Access denied" });
     }
 
-    const records = await Record.find({ user: req.params.patientId }).sort({ createdAt: -1 });
+    const records = await Record.find({ user: req.params.patientId }).sort({ createdAt: +1 });
     
     const formattedRecords = records.map(rec => ({

[Survived] StringLiteral
routes/recordRoutes.js:124:16
     
     const formattedRecords = records.map(rec => ({
       ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
+      fileUrl: ``
     }));
 

[Survived] StringLiteral
routes/recordRoutes.js:124:45
     
     const formattedRecords = records.map(rec => ({
       ...rec._doc,
-      fileUrl: `${req.protocol}://${req.get("host")}/uploads/${rec.filename}`
+      fileUrl: `${req.protocol}://${req.get("")}/uploads/${rec.filename}`
     }));
 

[Survived] BlockStatement
routes/recordRoutes.js:128:17
     }));
 
     res.json(formattedRecords);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching patient records" });
-  }
+  } catch (err) {}
 });
 

[Survived] BlockStatement
routes/recordRoutes.js:134:67
 });
 
 /* ================= 5. DELETE RECORD (Doctor Only) ================= */
-router.delete("/records/:id", authMiddleware, async (req, res) => {
-  try {
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Only doctors can delete records" });
-    }
-
-    const record = await Record.findById(req.params.id);
-    if (!record) return res.status(404).json({ message: "Record not found" });
-
-    if (fs.existsSync(record.path)) {
-      fs.unlinkSync(record.path);
-    }
-
-    await Record.findByIdAndDelete(req.params.id);
-    res.json({ message: "Record deleted" });
-
-  } catch (err) {
-    res.status(500).json({ message: "Delete failed" });
-  }
-});
+router.delete("/records/:id", authMiddleware, async (req, res) => {});
 
 module.exports = router;

[Survived] StringLiteral
routes/recordRoutes.js:134:15
 });
 
 /* ================= 5. DELETE RECORD (Doctor Only) ================= */
-router.delete("/records/:id", authMiddleware, async (req, res) => {
+router.delete("", authMiddleware, async (req, res) => {
   try {
     if (req.user.role !== "doctor") {

[Survived] BlockStatement
routes/recordRoutes.js:135:7
 
 /* ================= 5. DELETE RECORD (Doctor Only) ================= */
 router.delete("/records/:id", authMiddleware, async (req, res) => {
-  try {
-    if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Only doctors can delete records" });
-    }
-
-    const record = await Record.findById(req.params.id);
-    if (!record) return res.status(404).json({ message: "Record not found" });
-
-    if (fs.existsSync(record.path)) {
-      fs.unlinkSync(record.path);
-    }
-
-    await Record.findByIdAndDelete(req.params.id);
-    res.json({ message: "Record deleted" });
-
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Delete failed" });
   }

[Survived] ObjectLiteral
routes/recordRoutes.js:137:35
 router.delete("/records/:id", authMiddleware, async (req, res) => {
   try {
     if (req.user.role !== "doctor") {
-      return res.status(403).json({ message: "Only doctors can delete records" });
+      return res.status(403).json({});
     }
 

[Survived] ConditionalExpression
routes/recordRoutes.js:141:9
     }
 
     const record = await Record.findById(req.params.id);
-    if (!record) return res.status(404).json({ message: "Record not found" });
+    if (false) return res.status(404).json({ message: "Record not found" });
 
     if (fs.existsSync(record.path)) {

[Survived] BooleanLiteral
routes/recordRoutes.js:141:9
     }
 
     const record = await Record.findById(req.params.id);
-    if (!record) return res.status(404).json({ message: "Record not found" });
+    if (record) return res.status(404).json({ message: "Record not found" });
 
     if (fs.existsSync(record.path)) {

[Survived] BlockStatement
routes/recordRoutes.js:143:37
     const record = await Record.findById(req.params.id);
     if (!record) return res.status(404).json({ message: "Record not found" });
 
-    if (fs.existsSync(record.path)) {
-      fs.unlinkSync(record.path);
-    }
+    if (fs.existsSync(record.path)) {}
 
     await Record.findByIdAndDelete(req.params.id);

[Survived] ConditionalExpression
routes/recordRoutes.js:143:9
     const record = await Record.findById(req.params.id);
     if (!record) return res.status(404).json({ message: "Record not found" });
 
-    if (fs.existsSync(record.path)) {
+    if (false) {
       fs.unlinkSync(record.path);
     }

[Survived] ObjectLiteral
routes/recordRoutes.js:148:14
     }
 
     await Record.findByIdAndDelete(req.params.id);
-    res.json({ message: "Record deleted" });
+    res.json({});
 
   } catch (err) {

[Survived] BlockStatement
routes/recordRoutes.js:150:17
     await Record.findByIdAndDelete(req.params.id);
     res.json({ message: "Record deleted" });
 
-  } catch (err) {
-    res.status(500).json({ message: "Delete failed" });
-  }
+  } catch (err) {}
 });
 

[Survived] ObjectLiteral
routes/recordRoutes.js:151:26
     res.json({ message: "Record deleted" });
 
   } catch (err) {
-    res.status(500).json({ message: "Delete failed" });
+    res.status(500).json({});
   }
 });
