[Survived] BlockStatement
routes/riskRoutes.js:7:36
 
 const calculateRisk = require("../riskCalculator");
 
-router.post("/risk", (req, res) => {
-  try {
-    
-    const result = calculateRisk(req.body);
-
-    res.json(result);
-  } catch (err) {
-    res.status(500).json({ error: "Risk calculation failed" });
-  }
-});
+router.post("/risk", (req, res) => {});
 
 module.exports = router;

[Survived] StringLiteral
routes/riskRoutes.js:7:13
 
 const calculateRisk = require("../riskCalculator");
 
-router.post("/risk", (req, res) => {
+router.post("", (req, res) => {
   try {
     

[Survived] BlockStatement
routes/riskRoutes.js:8:7
 const calculateRisk = require("../riskCalculator");
 
 router.post("/risk", (req, res) => {
-  try {
-    
-    const result = calculateRisk(req.body);
-
-    res.json(result);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ error: "Risk calculation failed" });
   }

[Survived] BlockStatement
routes/riskRoutes.js:13:17
     const result = calculateRisk(req.body);
 
     res.json(result);
-  } catch (err) {
-    res.status(500).json({ error: "Risk calculation failed" });
-  }
+  } catch (err) {}
 });
 
