[Survived] BlockStatement
config/db.js:3:31
 const mongoose = require("mongoose");
 
-const connectDB = async () => {
-  try {
-    await mongoose.connect("mongodb://mongo:27017/healthcare");
-    console.log("MongoDB Connected");
-  } catch (error) {
-    console.log("DB Connection Error:", error);
-    process.exit(1);
-  }
-};
+const connectDB = async () => {};
 
 module.exports = connectDB;

[Survived] BlockStatement
config/db.js:4:7
 const mongoose = require("mongoose");
 
 const connectDB = async () => {
-  try {
-    await mongoose.connect("mongodb://mongo:27017/healthcare");
-    console.log("MongoDB Connected");
-  } catch (error) {
+  try {} catch (error) {
     console.log("DB Connection Error:", error);
     process.exit(1);

[Survived] BlockStatement
config/db.js:7:19
   try {
     await mongoose.connect("mongodb://mongo:27017/healthcare");
     console.log("MongoDB Connected");
-  } catch (error) {
-    console.log("DB Connection Error:", error);
-    process.exit(1);
-  }
+  } catch (error) {}
 };
 

[Survived] StringLiteral
config/db.js:8:17
     await mongoose.connect("mongodb://mongo:27017/healthcare");
     console.log("MongoDB Connected");
   } catch (error) {
-    console.log("DB Connection Error:", error);
+    console.log("", error);
     process.exit(1);
   }
