[Survived] BlockStatement
controllers/adminController.js:4:40
 const User = require("../models/User");
 
 // Get total counts
-exports.getStats = async (req, res) => {
-  try {
-    const totalUsers = await User.countDocuments();
-    const totalPatients = await User.countDocuments({ role: "patient" });
-    const totalDoctors = await User.countDocuments({ role: "doctor" });
-
-    res.json({
-      totalUsers,
-      totalPatients,
-      totalDoctors
-    });
-
-  } catch (error) {
-    console.error("Admin Stats Error:", error);
-    res.status(500).json({ message: "Failed to fetch stats" });
-  }
-};
+exports.getStats = async (req, res) => {};
 
 

[Survived] BlockStatement
controllers/adminController.js:5:7
 
 // Get total counts
 exports.getStats = async (req, res) => {
-  try {
-    const totalUsers = await User.countDocuments();
-    const totalPatients = await User.countDocuments({ role: "patient" });
-    const totalDoctors = await User.countDocuments({ role: "doctor" });
-
-    res.json({
-      totalUsers,
-      totalPatients,
-      totalDoctors
-    });
-
-  } catch (error) {
+  try {} catch (error) {
     console.error("Admin Stats Error:", error);
     res.status(500).json({ message: "Failed to fetch stats" });

[Survived] ObjectLiteral
controllers/adminController.js:10:14
     const totalPatients = await User.countDocuments({ role: "patient" });
     const totalDoctors = await User.countDocuments({ role: "doctor" });
 
-    res.json({
-      totalUsers,
-      totalPatients,
-      totalDoctors
-    });
+    res.json({});
 
   } catch (error) {

[Survived] BlockStatement
controllers/adminController.js:16:19
       totalDoctors
     });
 
-  } catch (error) {
-    console.error("Admin Stats Error:", error);
-    res.status(500).json({ message: "Failed to fetch stats" });
-  }
+  } catch (error) {}
 };
 

[Survived] StringLiteral
controllers/adminController.js:18:37
 
   } catch (error) {
     console.error("Admin Stats Error:", error);
-    res.status(500).json({ message: "Failed to fetch stats" });
+    res.status(500).json({ message: "" });
   }
 };

[Survived] ObjectLiteral
controllers/adminController.js:18:26
 
   } catch (error) {
     console.error("Admin Stats Error:", error);
-    res.status(500).json({ message: "Failed to fetch stats" });
+    res.status(500).json({});
   }
 };

[Survived] BlockStatement
controllers/adminController.js:23:46
 };
 
 
-exports.getUsersByRole = async (req, res) => {
-  try {
-    const role = req.params.role;
-
-    const users = await User.find({ role }).select("name email");
-
-    res.json(users);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching users" });
-  }
-};
+exports.getUsersByRole = async (req, res) => {};

[Survived] BlockStatement
controllers/adminController.js:24:7
 
 
 exports.getUsersByRole = async (req, res) => {
-  try {
-    const role = req.params.role;
-
-    const users = await User.find({ role }).select("name email");
-
-    res.json(users);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Error fetching users" });
   }

[Survived] ObjectLiteral
controllers/adminController.js:27:35
   try {
     const role = req.params.role;
 
-    const users = await User.find({ role }).select("name email");
+    const users = await User.find({}).select("name email");
 
     res.json(users);

[Survived] BlockStatement
controllers/adminController.js:30:17
     const users = await User.find({ role }).select("name email");
 
     res.json(users);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching users" });
-  }
+  } catch (err) {}
 };

[Survived] ObjectLiteral
controllers/adminController.js:31:26
 
     res.json(users);
   } catch (err) {
-    res.status(500).json({ message: "Error fetching users" });
+    res.status(500).json({});
   }
 };

[Survived] StringLiteral
controllers/adminController.js:31:37
 
     res.json(users);
   } catch (err) {
-    res.status(500).json({ message: "Error fetching users" });
+    res.status(500).json({ message: "" });
   }
 };
