[Survived] BlockStatement
controllers/appointmentController.js:3:47
 const Appointment = require("../models/Appointment");
 
-exports.bookAppointment = async (req, res) => {
-  try {
-    // 1. Destructure all fields from the request body
-    const { doctorId, date, time, problem, duration, description } = req.body;
-
-    // 2. Create the appointment
-    const appointment = await Appointment.create({
-      patientId: req.userId, // From middleware
-      doctorId,
-      date,
-      time,
-      problem,
-      duration,
-      description
-    });
-
-    res.status(201).json({ success: true, appointment });
-  } catch (error) {
-    console.error("Booking Error:", error);
-    res.status(500).json({ message: "Booking failed" });
-  }
-};
+exports.bookAppointment = async (req, res) => {};
 
 exports.getPatientAppointments = async (req, res) => {

[Survived] BlockStatement
controllers/appointmentController.js:4:7
 const Appointment = require("../models/Appointment");
 
 exports.bookAppointment = async (req, res) => {
-  try {
-    // 1. Destructure all fields from the request body
-    const { doctorId, date, time, problem, duration, description } = req.body;
-
-    // 2. Create the appointment
-    const appointment = await Appointment.create({
-      patientId: req.userId, // From middleware
-      doctorId,
-      date,
-      time,
-      problem,
-      duration,
-      description
-    });
-
-    res.status(201).json({ success: true, appointment });
-  } catch (error) {
+  try {} catch (error) {
     console.error("Booking Error:", error);
     res.status(500).json({ message: "Booking failed" });

[Survived] BooleanLiteral
controllers/appointmentController.js:19:37
       description
     });
 
-    res.status(201).json({ success: true, appointment });
+    res.status(201).json({ success: false, appointment });
   } catch (error) {
     console.error("Booking Error:", error);

[Survived] BlockStatement
controllers/appointmentController.js:20:19
     });
 
     res.status(201).json({ success: true, appointment });
-  } catch (error) {
-    console.error("Booking Error:", error);
-    res.status(500).json({ message: "Booking failed" });
-  }
+  } catch (error) {}
 };
 

[Survived] StringLiteral
controllers/appointmentController.js:21:19
 
     res.status(201).json({ success: true, appointment });
   } catch (error) {
-    console.error("Booking Error:", error);
+    console.error("", error);
     res.status(500).json({ message: "Booking failed" });
   }

[Survived] StringLiteral
controllers/appointmentController.js:22:37
     res.status(201).json({ success: true, appointment });
   } catch (error) {
     console.error("Booking Error:", error);
-    res.status(500).json({ message: "Booking failed" });
+    res.status(500).json({ message: "" });
   }
 };

[Survived] BlockStatement
controllers/appointmentController.js:26:54
   }
 };
 
-exports.getPatientAppointments = async (req, res) => {
-  try {
-    const appointments = await Appointment.find({ patientId: req.userId })
-      .populate("doctorId", "name specialty") // populate doctor details
-      .sort({ createdAt: -1 });
-    res.json(appointments);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching appointments" });
-  }
-};
+exports.getPatientAppointments = async (req, res) => {};

[Survived] BlockStatement
controllers/appointmentController.js:27:7
 };
 
 exports.getPatientAppointments = async (req, res) => {
-  try {
-    const appointments = await Appointment.find({ patientId: req.userId })
-      .populate("doctorId", "name specialty") // populate doctor details
-      .sort({ createdAt: -1 });
-    res.json(appointments);
-  } catch (err) {
+  try {} catch (err) {
     res.status(500).json({ message: "Error fetching appointments" });
   }

[Survived] MethodExpression
controllers/appointmentController.js:28:32
 
 exports.getPatientAppointments = async (req, res) => {
   try {
-    const appointments = await Appointment.find({ patientId: req.userId })
-      .populate("doctorId", "name specialty") // populate doctor details
-      .sort({ createdAt: -1 });
+    const appointments = await Appointment.find({
+  patientId: req.userId
+}).populate("doctorId", "name specialty") // populate doctor details;
     res.json(appointments);
   } catch (err) {

[Survived] UnaryOperator
controllers/appointmentController.js:30:26
   try {
     const appointments = await Appointment.find({ patientId: req.userId })
       .populate("doctorId", "name specialty") // populate doctor details
-      .sort({ createdAt: -1 });
+      .sort({ createdAt: +1 });
     res.json(appointments);
   } catch (err) {

[Survived] BlockStatement
controllers/appointmentController.js:32:17
       .populate("doctorId", "name specialty") // populate doctor details
       .sort({ createdAt: -1 });
     res.json(appointments);
-  } catch (err) {
-    res.status(500).json({ message: "Error fetching appointments" });
-  }
+  } catch (err) {}
 };
