[Survived] BlockStatement
controllers/doctorController.js:4:42
 const User = require("../models/User");
 const Appointment = require("../models/Appointment");
 
-exports.getDoctors = async (req, res) => {
-  const doctors = await User.find({ role: "doctor" }).select("-password");
-  res.json(doctors);
-};
+exports.getDoctors = async (req, res) => {};
 
 exports.getDoctorAppointments = async (req, res) => {

[Survived] ObjectLiteral
controllers/doctorController.js:5:35
 const Appointment = require("../models/Appointment");
 
 exports.getDoctors = async (req, res) => {
-  const doctors = await User.find({ role: "doctor" }).select("-password");
+  const doctors = await User.find({}).select("-password");
   res.json(doctors);
 };

[Survived] BlockStatement
controllers/doctorController.js:9:53
   res.json(doctors);
 };
 
-exports.getDoctorAppointments = async (req, res) => {
-  try {
-    const appointments = await Appointment.find({
-      doctorId: req.userId
-    })
-    .populate("patientId", "name email")   
-    .sort({ createdAt: -1 });             
-
-    res.json(appointments);
-
-  } catch (error) {
-    console.error("Doctor Appointment Error:", error);
-    res.status(500).json({ message: "Failed to fetch appointments" });
-  }
-};
+exports.getDoctorAppointments = async (req, res) => {};

[Survived] BlockStatement
controllers/doctorController.js:10:7
 };
 
 exports.getDoctorAppointments = async (req, res) => {
-  try {
-    const appointments = await Appointment.find({
-      doctorId: req.userId
-    })
-    .populate("patientId", "name email")   
-    .sort({ createdAt: -1 });             
-
-    res.json(appointments);
-
-  } catch (error) {
+  try {} catch (error) {
     console.error("Doctor Appointment Error:", error);
     res.status(500).json({ message: "Failed to fetch appointments" });

[Survived] MethodExpression
controllers/doctorController.js:11:32
 
 exports.getDoctorAppointments = async (req, res) => {
   try {
-    const appointments = await Appointment.find({
-      doctorId: req.userId
-    })
-    .populate("patientId", "name email")   
-    .sort({ createdAt: -1 });             
+    const appointments = await Appointment.find({
+  doctorId: req.userId
+}).populate("patientId", "name email");             
 
     res.json(appointments);

[Survived] StringLiteral
controllers/doctorController.js:14:15
     const appointments = await Appointment.find({
       doctorId: req.userId
     })
-    .populate("patientId", "name email")   
+    .populate("", "name email")   
     .sort({ createdAt: -1 });             
 

[Survived] UnaryOperator
controllers/doctorController.js:15:24
       doctorId: req.userId
     })
     .populate("patientId", "name email")   
-    .sort({ createdAt: -1 });             
+    .sort({ createdAt: +1 });             
 
     res.json(appointments);

[Survived] BlockStatement
controllers/doctorController.js:19:19
 
     res.json(appointments);
 
-  } catch (error) {
-    console.error("Doctor Appointment Error:", error);
-    res.status(500).json({ message: "Failed to fetch appointments" });
-  }
+  } catch (error) {}
 };

[Survived] StringLiteral
controllers/doctorController.js:21:37
 
   } catch (error) {
     console.error("Doctor Appointment Error:", error);
-    res.status(500).json({ message: "Failed to fetch appointments" });
+    res.status(500).json({ message: "" });
   }
 };
