[Survived] BlockStatement
routes/adminRoutes.js:6:61
 const verifyToken = require("../middleware/authMiddleware");
 const adminController = require("../controllers/adminController");
 
-router.get("/admin/stats", verifyToken, (req, res, next) => {
-  if (req.role !== "admin") {
-    return res.status(403).json({ message: "Access Denied: Admin only" });
-  }
-  next();
-}, adminController.getStats);
+router.get("/admin/stats", verifyToken, (req, res, next) => {}, adminController.getStats);
 
 router.get("/admin/users/:role", verifyToken, (req, res, next) => {

[Survived] ConditionalExpression
routes/adminRoutes.js:7:7
 const adminController = require("../controllers/adminController");
 
 router.get("/admin/stats", verifyToken, (req, res, next) => {
-  if (req.role !== "admin") {
+  if (false) {
     return res.status(403).json({ message: "Access Denied: Admin only" });
   }

[Survived] ConditionalExpression
routes/adminRoutes.js:7:7
 const adminController = require("../controllers/adminController");
 
 router.get("/admin/stats", verifyToken, (req, res, next) => {
-  if (req.role !== "admin") {
+  if (true) {
     return res.status(403).json({ message: "Access Denied: Admin only" });
   }

[Survived] StringLiteral
routes/adminRoutes.js:8:44
 
 router.get("/admin/stats", verifyToken, (req, res, next) => {
   if (req.role !== "admin") {
-    return res.status(403).json({ message: "Access Denied: Admin only" });
+    return res.status(403).json({ message: "" });
   }
   next();

[Survived] BlockStatement
routes/adminRoutes.js:13:67
   next();
 }, adminController.getStats);
 
-router.get("/admin/users/:role", verifyToken, (req, res, next) => {
-  if (req.role !== "admin") {
-    return res.status(403).json({ message: "Admin only" });
-  }
-  next();
-}, adminController.getUsersByRole);
+router.get("/admin/users/:role", verifyToken, (req, res, next) => {}, adminController.getUsersByRole);
 
 module.exports = router;

[Survived] StringLiteral
routes/adminRoutes.js:13:12
   next();
 }, adminController.getStats);
 
-router.get("/admin/users/:role", verifyToken, (req, res, next) => {
+router.get("", verifyToken, (req, res, next) => {
   if (req.role !== "admin") {
     return res.status(403).json({ message: "Admin only" });

[Survived] EqualityOperator
routes/adminRoutes.js:14:7
 }, adminController.getStats);
 
 router.get("/admin/users/:role", verifyToken, (req, res, next) => {
-  if (req.role !== "admin") {
+  if (req.role === "admin") {
     return res.status(403).json({ message: "Admin only" });
   }

[Survived] BlockStatement
routes/adminRoutes.js:14:29
 }, adminController.getStats);
 
 router.get("/admin/users/:role", verifyToken, (req, res, next) => {
-  if (req.role !== "admin") {
-    return res.status(403).json({ message: "Admin only" });
-  }
+  if (req.role !== "admin") {}
   next();
 }, adminController.getUsersByRole);
