[Survived] StringLiteral
routes/chatRoutes.js:11:13
   apiKey: process.env.GROQ_API_KEY,
 });
 
-router.post("/chat", async (req, res) => {
+router.post("", async (req, res) => {
   try {
     const { message } = req.body;

[Survived] ConditionalExpression
routes/chatRoutes.js:15:9
   try {
     const { message } = req.body;
 
-    if (!message) {
+    if (true) {
       return res.status(400).json({ error: "Message is required" });
     }

[Survived] ObjectLiteral
routes/chatRoutes.js:16:35
     const { message } = req.body;
 
     if (!message) {
-      return res.status(400).json({ error: "Message is required" });
+      return res.status(400).json({});
     }
 

[Survived] ObjectLiteral
routes/chatRoutes.js:21:9
 
     const completion = await groq.chat.completions.create({
       messages: [
-        {
-          role: "system",
-          content: `
-You are a healthcare assistant.
-- Give only basic health advice
-- Do NOT diagnose serious diseases
-- Always suggest consulting a doctor
-- If symptoms are severe → say "Seek immediate medical help"
-          `,
-        },
+        {},
         {
           role: "user",

[Survived] StringLiteral
routes/chatRoutes.js:22:17
     const completion = await groq.chat.completions.create({
       messages: [
         {
-          role: "system",
+          role: "",
           content: `
 You are a healthcare assistant.

[Survived] StringLiteral
routes/chatRoutes.js:23:20
       messages: [
         {
           role: "system",
-          content: `
-You are a healthcare assistant.
-- Give only basic health advice
-- Do NOT diagnose serious diseases
-- Always suggest consulting a doctor
-- If symptoms are severe → say "Seek immediate medical help"
-          `,
+          content: ``,
         },
         {

[Survived] StringLiteral
routes/chatRoutes.js:32:17
           `,
         },
         {
-          role: "user",
+          role: "",
           content: message,
         },

[Survived] StringLiteral
routes/chatRoutes.js:36:14
           content: message,
         },
       ],
-      model: "llama-3.1-8b-instant",
+      model: "",
     });
 

[Survived] ConditionalExpression
routes/chatRoutes.js:42:7
     console.log("FULL RESPONSE:", completion);
 
     const reply =
-      completion?.choices?.[0]?.message?.content || "No response from AI";
+      true;
 
     res.json({ reply });

[Survived] OptionalChaining
routes/chatRoutes.js:42:7
     console.log("FULL RESPONSE:", completion);
 
     const reply =
-      completion?.choices?.[0]?.message?.content || "No response from AI";
+      completion.choices?.[0]?.message?.content || "No response from AI";
 
     res.json({ reply });

[Survived] ObjectLiteral
routes/chatRoutes.js:44:14
     const reply =
       completion?.choices?.[0]?.message?.content || "No response from AI";
 
-    res.json({ reply });
+    res.json({});
 
   } catch (err) {

[Survived] BlockStatement
routes/chatRoutes.js:46:17
 
     res.json({ reply });
 
-  } catch (err) {
-    console.error("❌ CHAT ERROR:", err.response?.data || err.message);
-
-    res.status(500).json({
-      error: "Chatbot failed",
-      details: err.message,
-    });
-  }
+  } catch (err) {}
 });
 

[Survived] LogicalOperator
routes/chatRoutes.js:47:36
     res.json({ reply });
 
   } catch (err) {
-    console.error("❌ CHAT ERROR:", err.response?.data || err.message);
+    console.error("❌ CHAT ERROR:", err.response?.data && err.message);
 
     res.status(500).json({

[Survived] ConditionalExpression
routes/chatRoutes.js:47:36
     res.json({ reply });
 
   } catch (err) {
-    console.error("❌ CHAT ERROR:", err.response?.data || err.message);
+    console.error("❌ CHAT ERROR:", true);
 
     res.status(500).json({

[Survived] ObjectLiteral
routes/chatRoutes.js:49:26
   } catch (err) {
     console.error("❌ CHAT ERROR:", err.response?.data || err.message);
 
-    res.status(500).json({
-      error: "Chatbot failed",
-      details: err.message,
-    });
+    res.status(500).json({});
   }
 });

[Survived] StringLiteral
routes/chatRoutes.js:50:14
     console.error("❌ CHAT ERROR:", err.response?.data || err.message);
 
     res.status(500).json({
-      error: "Chatbot failed",
+      error: "",
       details: err.message,
     });
