[Survived] BlockStatement
routes/reminderRoutes.js:5:50
 const router = express.Router();
 const Reminder = require("../models/Reminder");
 
-router.post("/add-reminder", async (req, res) => {
-  try {
-    const { email, title, time } = req.body;
-
-    const reminder = new Reminder({
-      email,
-      title,
-      time: new Date(time),
-    });
-
-    await reminder.save();
-
-    res.json({ message: "Reminder added successfully!" });
-
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ error: "Failed to add reminder" });
-  }
-});
+router.post("/add-reminder", async (req, res) => {});
 
 module.exports = router;

[Survived] BlockStatement
routes/reminderRoutes.js:6:7
 const Reminder = require("../models/Reminder");
 
 router.post("/add-reminder", async (req, res) => {
-  try {
-    const { email, title, time } = req.body;
-
-    const reminder = new Reminder({
-      email,
-      title,
-      time: new Date(time),
-    });
-
-    await reminder.save();
-
-    res.json({ message: "Reminder added successfully!" });
-
-  } catch (err) {
+  try {} catch (err) {
     console.error(err);
     res.status(500).json({ error: "Failed to add reminder" });

[Survived] BlockStatement
routes/reminderRoutes.js:19:17
 
     res.json({ message: "Reminder added successfully!" });
 
-  } catch (err) {
-    console.error(err);
-    res.status(500).json({ error: "Failed to add reminder" });
-  }
+  } catch (err) {}
 });
 
