[Survived] ConditionalExpression
routes/riskRoutes.js:11:9
     let risk = 0;
 
    
-    if (age > 40) risk += 20;
+    if (false) risk += 20;
     if (bmi > 25) risk += 20;
     if (bp === "high") risk += 20;

[Survived] AssignmentOperator
routes/riskRoutes.js:11:19
     let risk = 0;
 
    
-    if (age > 40) risk += 20;
+    if (age > 40) risk -= 20;
     if (bmi > 25) risk += 20;
     if (bp === "high") risk += 20;

[Survived] ConditionalExpression
routes/riskRoutes.js:12:9
 
    
     if (age > 40) risk += 20;
-    if (bmi > 25) risk += 20;
+    if (true) risk += 20;
     if (bp === "high") risk += 20;
     if (sugar === "high") risk += 25;

[Survived] ConditionalExpression
routes/riskRoutes.js:12:9
 
    
     if (age > 40) risk += 20;
-    if (bmi > 25) risk += 20;
+    if (false) risk += 20;
     if (bp === "high") risk += 20;
     if (sugar === "high") risk += 25;

[Survived] AssignmentOperator
routes/riskRoutes.js:13:24
    
     if (age > 40) risk += 20;
     if (bmi > 25) risk += 20;
-    if (bp === "high") risk += 20;
+    if (bp === "high") risk -= 20;
     if (sugar === "high") risk += 25;
     if (smoking === "yes") risk += 15;

[Survived] ConditionalExpression
routes/riskRoutes.js:13:9
    
     if (age > 40) risk += 20;
     if (bmi > 25) risk += 20;
-    if (bp === "high") risk += 20;
+    if (true) risk += 20;
     if (sugar === "high") risk += 25;
     if (smoking === "yes") risk += 15;

[Survived] ConditionalExpression
routes/riskRoutes.js:14:9
     if (age > 40) risk += 20;
     if (bmi > 25) risk += 20;
     if (bp === "high") risk += 20;
-    if (sugar === "high") risk += 25;
+    if (true) risk += 25;
     if (smoking === "yes") risk += 15;
 

[Survived] AssignmentOperator
routes/riskRoutes.js:14:27
     if (age > 40) risk += 20;
     if (bmi > 25) risk += 20;
     if (bp === "high") risk += 20;
-    if (sugar === "high") risk += 25;
+    if (sugar === "high") risk -= 25;
     if (smoking === "yes") risk += 15;
 

[Survived] AssignmentOperator
routes/riskRoutes.js:15:28
     if (bmi > 25) risk += 20;
     if (bp === "high") risk += 20;
     if (sugar === "high") risk += 25;
-    if (smoking === "yes") risk += 15;
+    if (smoking === "yes") risk -= 15;
 
     let level = "LOW";

[Survived] ConditionalExpression
routes/riskRoutes.js:15:9
     if (bmi > 25) risk += 20;
     if (bp === "high") risk += 20;
     if (sugar === "high") risk += 25;
-    if (smoking === "yes") risk += 15;
+    if (true) risk += 15;
 
     let level = "LOW";

[Survived] EqualityOperator
routes/riskRoutes.js:18:9
     if (smoking === "yes") risk += 15;
 
     let level = "LOW";
-    if (risk > 60) level = "HIGH";
+    if (risk >= 60) level = "HIGH";
     else if (risk > 30) level = "MEDIUM";
 

[Survived] ConditionalExpression
routes/riskRoutes.js:18:9
     if (smoking === "yes") risk += 15;
 
     let level = "LOW";
-    if (risk > 60) level = "HIGH";
+    if (false) level = "HIGH";
     else if (risk > 30) level = "MEDIUM";
 

[Survived] ConditionalExpression
routes/riskRoutes.js:19:14
 
     let level = "LOW";
     if (risk > 60) level = "HIGH";
-    else if (risk > 30) level = "MEDIUM";
+    else if (false) level = "MEDIUM";
 
     res.json({

[Survived] EqualityOperator
routes/riskRoutes.js:19:14
 
     let level = "LOW";
     if (risk > 60) level = "HIGH";
-    else if (risk > 30) level = "MEDIUM";
+    else if (risk <= 30) level = "MEDIUM";
 
     res.json({

[Survived] ConditionalExpression
routes/riskRoutes.js:25:9
       risk,
       level,
       advice:
-        level === "HIGH"
+        false
           ? "Consult a doctor immediately"
           : level === "MEDIUM"

[Survived] ConditionalExpression
routes/riskRoutes.js:25:9
       risk,
       level,
       advice:
-        level === "HIGH"
+        true
           ? "Consult a doctor immediately"
           : level === "MEDIUM"

[Survived] EqualityOperator
routes/riskRoutes.js:27:13
       advice:
         level === "HIGH"
           ? "Consult a doctor immediately"
-          : level === "MEDIUM"
+          : level !== "MEDIUM"
           ? "Maintain a healthy lifestyle"
           : "You are in good condition",

[Survived] ConditionalExpression
routes/riskRoutes.js:27:13
       advice:
         level === "HIGH"
           ? "Consult a doctor immediately"
-          : level === "MEDIUM"
+          : false
           ? "Maintain a healthy lifestyle"
           : "You are in good condition",

[Survived] BlockStatement
routes/riskRoutes.js:31:17
           ? "Maintain a healthy lifestyle"
           : "You are in good condition",
     });
-  } catch (err) {
-    res.status(500).json({ error: "Risk calculation failed" });
-  }
+  } catch (err) {}
 });
 

[Survived] StringLiteral
routes/riskRoutes.js:32:35
           : "You are in good condition",
     });
   } catch (err) {
-    res.status(500).json({ error: "Risk calculation failed" });
+    res.status(500).json({ error: "" });
   }
 });
