[Survived] ObjectLiteral
routes/sosRoutes.js:6:48
 
 const nodemailer = require("nodemailer");
 
-const transporter = nodemailer.createTransport({
-  service: "gmail",
-  auth: {
-    user: process.env.EMAIL_USER,
-    pass: process.env.EMAIL_PASS,
-  },
-});
+const transporter = nodemailer.createTransport({});
 
 router.post("/sos", async (req, res) => {

[Survived] StringLiteral
routes/sosRoutes.js:18:17
   try {
     const { location, email } = req.body;
 
-    console.log("🚨 SOS ALERT RECEIVED");
+    console.log("";
     console.log("📍 Location:", location);
     console.log("📧 Email:", email);

[Survived] ObjectLiteral
routes/sosRoutes.js:23:32
     console.log("📧 Email:", email);
 
     // ✅ Send Email
-    await transporter.sendMail({
-      from: process.env.EMAIL_USER,
-      to: email, // 👈 user provided email
-      subject: "🚨 Emergency SOS Alert",
-      text: `
-🚨 EMERGENCY ALERT 🚨
-
-The user has triggered an SOS alert.
-
-📍 Location:
-https://www.google.com/maps?q=${location.lat},${location.lng}
-
-Please take immediate action.
-      `,
-    });
+    await transporter.sendMail({});
 
     res.json({

[Survived] StringLiteral
routes/sosRoutes.js:26:16
     await transporter.sendMail({
       from: process.env.EMAIL_USER,
       to: email, // 👈 user provided email
-      subject: "🚨 Emergency SOS Alert",
+      subject: ""
       text: `
 🚨 EMERGENCY ALERT 🚨

[Survived] StringLiteral
routes/sosRoutes.js:40:16
     });
 
     res.json({
-      message: "🚨 SOS sent + Email delivered successfully!",
+      message: ""
     });
 

[Survived] BlockStatement
routes/sosRoutes.js:43:17
       message: "🚨 SOS sent + Email delivered successfully!",
     });
 
-  } catch (err) {
-    console.error("❌ EMAIL ERROR:", err);
-    res.status(500).json({ error: "SOS email failed" });
-  }
+  } catch (err) {}
 });
 

[Survived] StringLiteral
routes/sosRoutes.js:44:19
     });
 
   } catch (err) {
-    console.error("❌ EMAIL ERROR:", err);
+    console.error("", err);
     res.status(500).json({ error: "SOS email failed" });
   }

[Survived] StringLiteral
routes/sosRoutes.js:45:35
 
   } catch (err) {
     console.error("❌ EMAIL ERROR:", err);
-    res.status(500).json({ error: "SOS email failed" });
+    res.status(500).json({ error: "" });
   }
 });
