[Survived] BlockStatement
server.js:30:29
 app.use(cors()); 
 app.use(express.json());
 
-app.use((req, res, next) => {
-  console.log(`${req.method} ${req.url}`);
-  next();
-});
+app.use((req, res, next) => {});
 
 

[Survived] StringLiteral
server.js:31:15
 app.use(express.json());
 
 app.use((req, res, next) => {
-  console.log(`${req.method} ${req.url}`);
+  console.log(``);
   next();
 });

[Survived] StringLiteral
server.js:45:9
 
 app.use("/api", authRoutes);
 app.use("/api", doctorRoutes);
-app.use("/api", appointmentRoutes);
+app.use("", appointmentRoutes);
 app.use("/api", recordRoutes);
 

[Survived] StringLiteral
server.js:48:9
 app.use("/api", appointmentRoutes);
 app.use("/api", recordRoutes);
 
-app.use("/api/chat", chatRoutes);
+app.use("", chatRoutes);
 
 app.use("/api", sosRoutes);

[Survived] StringLiteral
server.js:52:9
 
 app.use("/api", sosRoutes);
 
-app.use("/api", riskRoutes);
+app.use("", riskRoutes);
 
 

[Survived] StringLiteral
server.js:55:9
 app.use("/api", riskRoutes);
 
 
-app.use("/api", reminderRoutes);
+app.use("", reminderRoutes);
 
 

[Survived] BlockStatement
server.js:60:24
 
 app.use("/api", adminRoutes);
 
-app.listen(5000, () => {
-  console.log("Backend running on port 5000");
-});
+app.listen(5000, () => {});
